## Plan Result (account-data-deleter-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/197017)



<pre><code>Plan: 0 to add, 57 to change, 0 to destroy.</code></pre>

* Update
  * aws_acm_certificate.data-deleter-app_application_alb_certificate_FD655806
  * aws_alb.data-deleter-app_application_application_load_balancer_alb_1E12FF35
  * aws_alb_listener.data-deleter-app_application_listener_http_55B9BA83
  * aws_alb_listener.data-deleter-app_application_listener_https_634EB75E
  * aws_alb_listener_rule.data-deleter-app_application_ecs_service_listener_rule_1E84FFF2
  * aws_alb_target_group.data-deleter-app_application_ecs_service_blue_target_group_ecs_target_group_283B74DF
  * aws_alb_target_group.data-deleter-app_application_ecs_service_green_target_group_ecs_target_group_2F7CE961
  * aws_appautoscaling_target.data-deleter-app_application_autoscaling_autoscaling_target_02FF0938
  * aws_cloudwatch_event_rule.batchdeletelambda_add-batchDelete-lambda-trigger_event-bridge-rule_2852CA7A
  * aws_cloudwatch_log_group.batchdeletelambda_batch-delete-lambda_log-group_733861E0
  * aws_cloudwatch_log_group.data-deleter-app_app-log-group_AD731D31
  * aws_cloudwatch_log_group.event-consumer_sqs-event-consumer_lambda_log-group_970CA206
  * aws_cloudwatch_metric_alarm.data-deleter-app_application_alarm-httptarget5xxerrorrate_6FC46278
  * aws_cloudwatch_metric_alarm.data-deleter-app_application_autoscaling_scale_in_alarm_E6DFF327
  * aws_cloudwatch_metric_alarm.data-deleter-app_application_autoscaling_scale_out_alarm_ECA6EBEC
  * aws_codedeploy_app.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-app_F69B4EF8
  * aws_codedeploy_app.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_3F6E9850
  * aws_codedeploy_app.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-app_8782CBBF
  * aws_codedeploy_deployment_group.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deployment-group_C5F30D1B
  * aws_codedeploy_deployment_group.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_84B5DC1D
  * aws_codedeploy_deployment_group.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deployment-group_25E98995
  * aws_codestarnotifications_notification_rule.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_415EAA02
  * aws_dynamodb_table.batchdeletelambda_HistoricalDeletedUsers-Pending_dynamodb_table_225C7A6D
  * aws_dynamodb_table.batchdeletelambda_HistoricalDeletedUsers-Processed_dynamodb_table_889BF31E
  * aws_ecr_repository.data-deleter-app_application_ecs_service_ecr-app_ecr-repo_3026A62A
  * aws_ecs_cluster.data-deleter-app_application_ecs_cluster_72BD4946
  * aws_ecs_service.data-deleter-app_application_ecs_service_ecs-service_CE3A63CF
  * aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07
  * aws_iam_policy.batchdeletelambda_BatchDeleteLambda-lambda-dynamo-policy_D7410D4B
  * aws_iam_policy.batchdeletelambda_batch-delete-lambda_execution-policy_0CB4B8C7
  * aws_iam_policy.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-execution-role-policy_B4FDF02D
  * aws_iam_policy.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-role-policy_0A0BC3A4
  * aws_iam_policy.event-consumer_sqs-event-consumer_lambda_execution-policy_99388433
  * aws_iam_policy.event-consumer_sqs-event-consumer_sqs-policy_F429D868
  * aws_iam_role.batchdeletelambda_batch-delete-lambda_execution-role_28D715FA
  * aws_iam_role.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-role_9D02E0E0
  * aws_iam_role.data-deleter-app_application_ecs_service_ecs-iam_ecs-execution-role_A0A8D414
  * aws_iam_role.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-role_91290640
  * aws_iam_role.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_C71A976C
  * aws_iam_role.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-role_09F928DA
  * aws_iam_role.event-consumer_sqs-event-consumer_lambda_execution-role_DF2EA7D3
  * aws_lambda_function.batchdeletelambda_batch-delete-lambda_9A38729B
  * aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C
  * aws_route53_zone.data-deleter-app_application_base_dns_subhosted_zone_0A436834
  * aws_s3_bucket.batchdeletelambda_batch-delete-lambda_code-bucket_1341E11E
  * aws_s3_bucket.event-consumer_sqs-event-consumer_lambda_code-bucket_484E6323
  * aws_security_group.data-deleter-app_application_application_load_balancer_alb_security_group_D3CF9597
  * aws_security_group.data-deleter-app_application_ecs_service_ecs_security_group_8AA7466D
  * aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sqs_queue.batch-delete-consumer-queue_redrive_sqs_queue_B3F8A415
  * aws_sqs_queue.batch-delete-consumer-queue_sqs_queue_D3FD6851
  * aws_sqs_queue.event-consumer_sqs-event-consumer_lambda_sqs_queue_01854365
  * aws_sqs_queue.event-consumer_sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_05E61A7A
  * aws_sqs_queue.event-consumer_user-events-sns-subscription_sns-topic-dql_64AC6C4E
  * aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-dlq-policy_5F8E8B35
  * aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-sqs-policy_16608F07



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.batchdeletelambda_BatchDeleteLambda-lambda-dynamo-policy-doc_BB5F5C92 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "batchdeletelambda_BatchDeleteLambda-lambda-dynamo-policy-doc_BB5F5C92" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:us-east-1:996905175585:table/ADD-HistoricalDeletedUsers-Pending",
              + "arn:aws:dynamodb:us-east-1:996905175585:table/ADD-HistoricalDeletedUsers-Processed",
            ]
        }
    }

  # data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_A007BDF5 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_A007BDF5" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
      + version       = "2012-10-17"

      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:AccountDataDeleter-Prod-Sqs-Batch-Delete-Consumer-Queue",
            ]
        }
    }

  # data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_sqs_policy_87BD2525 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "event-consumer_sqs-event-consumer_lambda_sqs_policy_87BD2525" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue",
            ]
        }
    }

  # data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-dlq-policy-document_F0C4881F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "event-consumer_user-events-sns-subscription_sns-dlq-policy-document_F0C4881F" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:AccountDataDeleter-Prod-SNS-Topic-DLQ",
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-sqs-policy-document_A53F50B3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "event-consumer_user-events-sns-subscription_sns-sqs-policy-document_A53F50B3" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue",
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_acm_certificate.data-deleter-app_application_alb_certificate_FD655806 will be updated in-place
  ~ resource "aws_acm_certificate" "data-deleter-app_application_alb_certificate_FD655806" {
        id                        = "arn:aws:acm:us-east-1:996905175585:certificate/f6571689-cb7b-491c-878b-e3f64918d69f"
      ~ tags                      = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_alb.data-deleter-app_application_application_load_balancer_alb_1E12FF35 will be updated in-place
  ~ resource "aws_alb" "data-deleter-app_application_application_load_balancer_alb_1E12FF35" {
        id                                                           = "arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/ADD2022060219383277340000000e/056efebb82a27907"
        name                                                         = "ADD2022060219383277340000000e"
      ~ tags                                                         = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all                                                     = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # aws_alb_listener.data-deleter-app_application_listener_http_55B9BA83 will be updated in-place
  ~ resource "aws_alb_listener" "data-deleter-app_application_listener_http_55B9BA83" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/ADD2022060219383277340000000e/056efebb82a27907/c54976348a9a8721"
      ~ tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_alb_listener.data-deleter-app_application_listener_https_634EB75E will be updated in-place
  ~ resource "aws_alb_listener" "data-deleter-app_application_listener_https_634EB75E" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/ADD2022060219383277340000000e/056efebb82a27907/7de2045154779f08"
      ~ tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_listener_rule.data-deleter-app_application_ecs_service_listener_rule_1E84FFF2 will be updated in-place
  ~ resource "aws_alb_listener_rule" "data-deleter-app_application_ecs_service_listener_rule_1E84FFF2" {
        id           = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/ADD2022060219383277340000000e/056efebb82a27907/7de2045154779f08/e87bdfee5695d6a3"
      ~ tags         = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all     = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_target_group.data-deleter-app_application_ecs_service_blue_target_group_ecs_target_group_283B74DF will be updated in-place
  ~ resource "aws_alb_target_group" "data-deleter-app_application_ecs_service_blue_target_group_ecs_target_group_283B74DF" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/ADDblu20220602193822579700000007/d59c4de1e69e4d90"
        name                               = "ADDblu20220602193822579700000007"
      ~ tags                               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
            "type"           = "blue"
        }
      ~ tags_all                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (5 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_alb_target_group.data-deleter-app_application_ecs_service_green_target_group_ecs_target_group_2F7CE961 will be updated in-place
  ~ resource "aws_alb_target_group" "data-deleter-app_application_ecs_service_green_target_group_ecs_target_group_2F7CE961" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/ADDgre20220602193822338100000005/a23eb0fe81425bea"
        name                               = "ADDgre20220602193822338100000005"
      ~ tags                               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
            "type"           = "green"
        }
      ~ tags_all                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (5 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_appautoscaling_target.data-deleter-app_application_autoscaling_autoscaling_target_02FF0938 will be updated in-place
  ~ resource "aws_appautoscaling_target" "data-deleter-app_application_autoscaling_autoscaling_target_02FF0938" {
        id                 = "service/AccountDataDeleter-Prod/AccountDataDeleter-Prod"
        tags               = {}
      ~ tags_all           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.batchdeletelambda_add-batchDelete-lambda-trigger_event-bridge-rule_2852CA7A will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "batchdeletelambda_add-batchDelete-lambda-trigger_event-bridge-rule_2852CA7A" {
        id                  = "AccountDataDeleter-Prod-BatchDelete-Lambda-Trigger-Rule"
        name                = "AccountDataDeleter-Prod-BatchDelete-Lambda-Trigger-Rule"
        tags                = {}
      ~ tags_all            = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.batchdeletelambda_batch-delete-lambda_log-group_733861E0 will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "batchdeletelambda_batch-delete-lambda_log-group_733861E0" {
        id                = "/aws/lambda/AccountDataDeleter-Prod-BatchDeleteLambda-Function"
        name              = "/aws/lambda/AccountDataDeleter-Prod-BatchDeleteLambda-Function"
      ~ tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.data-deleter-app_app-log-group_AD731D31 will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "data-deleter-app_app-log-group_AD731D31" {
        id                = "/Backend/AccountDataDeleter-Prod/ecs/app"
        name              = "/Backend/AccountDataDeleter-Prod/ecs/app"
      ~ tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.event-consumer_sqs-event-consumer_lambda_log-group_970CA206 will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "event-consumer_sqs-event-consumer_lambda_log-group_970CA206" {
        id                = "/aws/lambda/AccountDataDeleter-Prod-Sqs-Event-Consumer-Function"
        name              = "/aws/lambda/AccountDataDeleter-Prod-Sqs-Event-Consumer-Function"
      ~ tags              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.data-deleter-app_application_alarm-httptarget5xxerrorrate_6FC46278 will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "data-deleter-app_application_alarm-httptarget5xxerrorrate_6FC46278" {
        id                                    = "AccountDataDeleter-Prod-Alarm-HTTPTarget5xxErrorRate"
      ~ tags                                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_cloudwatch_metric_alarm.data-deleter-app_application_autoscaling_scale_in_alarm_E6DFF327 will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "data-deleter-app_application_autoscaling_scale_in_alarm_E6DFF327" {
        id                                    = "AccountDataDeleter-Prod Service Low CPU"
      ~ tags                                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (21 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.data-deleter-app_application_autoscaling_scale_out_alarm_ECA6EBEC will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "data-deleter-app_application_autoscaling_scale_out_alarm_ECA6EBEC" {
        id                                    = "AccountDataDeleter-Prod Service High CPU"
      ~ tags                                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"    

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_C71A976C will be updated in-place
  ~ resource "aws_iam_role" "data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_C71A976C" {
        id                    = "AccountDataDeleter-Prod-ECSCodeDeployRole"
        name                  = "AccountDataDeleter-Prod-ECSCodeDeployRole"
      ~ tags                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-role_09F928DA will be updated in-place
  ~ resource "aws_iam_role" "event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-role_09F928DA" {
        id                    = "AccountDataDeleter-Prod-Sqs-Event-Consumer-CodeDeployRole"
        name                  = "AccountDataDeleter-Prod-Sqs-Event-Consumer-CodeDeployRole"
        tags                  = {}
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.event-consumer_sqs-event-consumer_lambda_execution-role_DF2EA7D3 will be updated in-place
  ~ resource "aws_iam_role" "event-consumer_sqs-event-consumer_lambda_execution-role_DF2EA7D3" {
        id                    = "AccountDataDeleter-Prod-Sqs-Event-Consumer-ExecutionRole"
        name                  = "AccountDataDeleter-Prod-Sqs-Event-Consumer-ExecutionRole"
      ~ tags                  = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.batchdeletelambda_batch-delete-lambda_9A38729B will be updated in-place
  ~ resource "aws_lambda_function" "batchdeletelambda_batch-delete-lambda_9A38729B" {
        id                             = "AccountDataDeleter-Prod-BatchDeleteLambda-Function"
      ~ tags                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all                       = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C will be updated in-place
  ~ resource "aws_lambda_function" "event-consumer_sqs-event-consumer_lambda_2F35855C" {
        id                             = "AccountDataDeleter-Prod-Sqs-Event-Consumer-Function"
      ~ tags                           = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all                       = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_route53_zone.data-deleter-app_application_base_dns_subhosted_zone_0A436834 will be updated in-place
  ~ resource "aws_route53_zone" "data-deleter-app_application_base_dns_subhosted_zone_0A436834" {
        id                  = "Z06690021XQYR4BI9JDYG"
        name                = "account-data-deleter-api.readitlater.com"
      ~ tags                = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all            = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket.batchdeletelambda_batch-delete-lambda_code-bucket_1341E11E will be updated in-place
  ~ resource "aws_s3_bucket" "batchdeletelambda_batch-delete-lambda_code-bucket_1341E11E" {
        id                          = "pocket-accountdatadeleter-prod-batchdeletelambda"
      ~ tags                        = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.event-consumer_sqs-event-consumer_lambda_code-bucket_484E6323 will be updated in-place
  ~ resource "aws_s3_bucket" "event-consumer_sqs-event-consumer_lambda_code-bucket_484E6323" {
        id                          = "pocket-accountdatadeleter-prod-sqs-event-consumer"
      ~ tags                        = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all                    = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_security_group.data-deleter-app_application_application_load_balancer_alb_security_group_D3CF9597 will be updated in-place
  ~ resource "aws_security_group" "data-deleter-app_application_application_load_balancer_alb_security_group_D3CF9597" {
        id                     = "sg-040d071fa04ee63d0"
        name                   = "AccountDataDeleter-Prod-HTTP/S Security Group20220602193822522100000006"
      ~ tags                   = {
            "Name"           = "AccountDataDeleter-Prod-HTTP/S Security Group"
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (5 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.data-deleter-app_application_ecs_service_ecs_security_group_8AA7466D will be updated in-place
  ~ resource "aws_security_group" "data-deleter-app_application_ecs_service_ecs_security_group_8AA7466D" {
        id                     = "sg-0f2d0f524792d876a"
        name                   = "AccountDataDeleter-Prod-ECSSecurityGroup2022060219383285240000000f"
      ~ tags                   = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all               = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_sns_topic.pagerduty_alarm-critical-topic_F1534579 will be updated in-place
  ~ resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:AccountDataDeleter-Prod-Infrastructure-Alarm-Critical"
        name                                     = "AccountDataDeleter-Prod-Infrastructure-Alarm-Critical"
        tags                                     = {}
      ~ tags_all                                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)
    }

  # aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3 will be updated in-place
  ~ resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:AccountDataDeleter-Prod-Infrastructure-Alarm-Non-Critical"
        name                                     = "AccountDataDeleter-Prod-Infrastructure-Alarm-Non-Critical"
        tags                                     = {}
      ~ tags_all                                 = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)
    }

  # aws_sqs_queue.batch-delete-consumer-queue_redrive_sqs_queue_B3F8A415 will be updated in-place
  ~ resource "aws_sqs_queue" "batch-delete-consumer-queue_redrive_sqs_queue_B3F8A415" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Batch-Delete-Consumer-Queue-Deadletter"
        name                              = "AccountDataDeleter-Prod-Sqs-Batch-Delete-Consumer-Queue-Deadletter"
      ~ tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.batch-delete-consumer-queue_sqs_queue_D3FD6851 will be updated in-place
  ~ resource "aws_sqs_queue" "batch-delete-consumer-queue_sqs_queue_D3FD6851" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Batch-Delete-Consumer-Queue"
        name                              = "AccountDataDeleter-Prod-Sqs-Batch-Delete-Consumer-Queue"
      ~ tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.event-consumer_sqs-event-consumer_lambda_sqs_queue_01854365 will be updated in-place
  ~ resource "aws_sqs_queue" "event-consumer_sqs-event-consumer_lambda_sqs_queue_01854365" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue"
        name                              = "AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue"
      ~ tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.event-consumer_sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_05E61A7A will be updated in-place
  ~ resource "aws_sqs_queue" "event-consumer_sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_05E61A7A" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue-Deadletter"
        name                              = "AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue-Deadletter"
      ~ tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.event-consumer_user-events-sns-subscription_sns-topic-dql_64AC6C4E will be updated in-place
  ~ resource "aws_sqs_queue" "event-consumer_user-events-sns-subscription_sns-topic-dql_64AC6C4E" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-SNS-Topic-DLQ"
        name                              = "AccountDataDeleter-Prod-SNS-Topic-DLQ"
      ~ tags                              = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
            "costCenter"     = "Pocket"
          + "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "AccountDataDeleter"
        }
      ~ tags_all                          = {
          + "app_code"       = "pocket"
          + "component_code" = "pocket-accountdatadeleter"
          + "env_code"       = "prod"
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-dlq-policy_5F8E8B35 will be updated in-place
  ~ resource "aws_sqs_queue_policy" "event-consumer_user-events-sns-subscription_sns-dlq-policy_5F8E8B35" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-SNS-Topic-DLQ"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnEquals = {
                              - "aws:SourceArn" = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:us-east-1:996905175585:AccountDataDeleter-Prod-SNS-Topic-DLQ"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-sqs-policy_16608F07 will be updated in-place
  ~ resource "aws_sqs_queue_policy" "event-consumer_user-events-sns-subscription_sns-sqs-policy_16608F07" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnEquals = {
                              - "aws:SourceArn" = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:us-east-1:996905175585:AccountDataDeleter-Prod-Sqs-Event-Consumer-Queue"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 57 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"f11a4c6a-c6d6-4418-bcae-057dded7f29e","JobName":"account-data-deleter_infrastructure_plan_prod","PRNumber":572,"Program":"tfcmt","SHA1":"8cce0ef636735b4f73d5efb2fde7796641120371","Target":"account-data-deleter-cdk","Vars":{}} -->